Revit 2024 API
BuiltInFailures.CreationFailures.CannotCreateElementInFamily Property
 Can't create element in this family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateElementInFamily { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateElementInFamily As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateElementInFamily {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace